---
kind: method
id: M:Autodesk.Revit.DB.InSessionViewSheetSet.Dispose
source: html/bfe009dc-6f22-2297-6481-8a8ff1ee8d48.htm
---
# Autodesk.Revit.DB.InSessionViewSheetSet.Dispose Method

Releases all resources used by the InSessionViewSheetSet

## Syntax (C#)
```csharp
public void Dispose()
```